<a href="https://colab.research.google.com/github/mjp002/Class/blob/master/Class65.ipynb" target="_parent"><img src="https://colab.research.google.com/assets/colab-badge.svg" alt="Open In Colab"/></a>

In [76]:
# class 65 algotest

#m, n, k = map(int, input().split())





#arr = [[0]*n for _ in range(m)]
#for i in range(n):
#  arr[i] = [int(j) for j in input().strip().split(" ")]

In [77]:
#a = arr=[0]

In [78]:
#m, n, k = map(int, input().split()) 
# M 배열수, N 원소개수, K 교환횟수 를 입력 받기

#arr = [[0]*n for _ in range(m)]
#for i in range(n):
#    arr[i] = [int(j) for j in input().strip().split(" ")]
 
#a = arr[0]

#b = arr[1:]

#a = list(map(int, input().split())) # 배열 A의 모든 원소를 입력받기
#b = list(map(int, input().split())) # 배열 B의 모든 원소를 입력받기

#a.sort() # 배열 A는 오름차순 정렬 수행
#b.sort(reverse=True) # 배열 B는 내림차순 정렬 수행

# 첫 번째 인덱스부터 확인하며, 두 배열의 원소를 최대 K번 비교
#for i in range(k):
    # A의 원소가 B의 원소보다 작은 경우
#    if a[i] < b[i]:
        # 두 원소를 교체
#        a[i], b[i] = b[i], a[i]
#    else: # A의 원소가 B의 원소보다 크거나 같을 때, 반복문을 탈출
#        break

#print(sum(a)) # 배열 A의 모든 원소의 합을 출력

In [79]:
import pandas as pd

df = pd.read_csv('ex1.csv')
df

   a   b   c   d message
0  1   2   3   4   hello
1  5   6   7   8   world
2  9  10  11  12     foo

In [80]:
df = pd.read_csv('ex1.csv', sep = ',')
df

   a   b   c   d message
0  1   2   3   4   hello
1  5   6   7   8   world
2  9  10  11  12     foo

In [81]:
df = pd.read_csv('ex1.csv', index_col='message')

df

         a   b   c   d
message
hello    1   2   3   4
world    5   6   7   8
foo      9  10  11  12

In [82]:
result = pd.read_csv('ex1.csv')

In [83]:
result

   a   b   c   d message
0  1   2   3   4   hello
1  5   6   7   8   world
2  9  10  11  12     foo

In [84]:
pd.isnull(result)

       a      b      c      d  message
0  False  False  False  False    False
1  False  False  False  False    False
2  False  False  False  False    False

In [85]:
result = pd.read_csv('ex5.csv', na_values=['NULL'])
result

  something  a   b     c   d message
0       one  1   2   3.0   4     NaN
1       two  5   6   NaN   8   world
2     three  9  10  11.0  12     foo

In [86]:
pd.options.display.max_rows = 10

In [87]:
result = pd.read_csv('ex6.csv')
result

           one       two     three      four key
0     0.467976 -0.038649 -0.295344 -1.824726   L
1    -0.358893  1.404453  0.704965 -0.200638   B
2    -0.501840  0.659254 -0.421691 -0.057688   G
3     0.204886  1.074134  1.388361 -0.982404   R
4     0.354628 -0.133116  0.283763 -0.837063   Q
...        ...       ...       ...       ...  ..
9995  2.311896 -0.417070 -1.409599 -0.515821   L
9996 -0.479893 -0.650419  0.745152 -0.646038   E
9997  0.523331  0.787112  0.486066  1.093156   K
9998 -0.362559  0.598894 -1.843201  0.887292   G
9999 -0.096376 -1.012999 -0.657431 -0.573315   0

[10000 rows x 5 columns]

In [88]:
pd.read_csv('ex6.csv', nrows=5)

        one       two     three      four key
0  0.467976 -0.038649 -0.295344 -1.824726   L
1 -0.358893  1.404453  0.704965 -0.200638   B
2 -0.501840  0.659254 -0.421691 -0.057688   G
3  0.204886  1.074134  1.388361 -0.982404   R
4  0.354628 -0.133116  0.283763 -0.837063   Q

In [89]:
chunker = df = pd.read_csv('ex6.csv', chunksize = 1000)
chunker

In [90]:
chunker = df = pd.read_csv('ex6.csv', chunksize = 1000)
tot = pd.Series([])
for piece in chunker:
  tot = tot.add(piece['key'].value_counts(), fill_value = 0)

tot = tot.sort_values(ascending=False)

/usr/local/lib/python3.6/dist-packages/ipykernel_launcher.py:2: DeprecationWarning: The default dtype for empty Series will be 'object' instead of 'float64' in a future version. Specify a dtype explicitly to silence this warning.

In [91]:
tot[:10]

E    368.0
X    364.0
L    346.0
O    343.0
Q    340.0
M    338.0
J    337.0
F    335.0
K    334.0
H    330.0
dtype: float64

In [92]:
data = pd.read_csv('ex5.csv')
data

  something  a   b     c   d message
0       one  1   2   3.0   4     NaN
1       two  5   6   NaN   8   world
2     three  9  10  11.0  12     foo

In [93]:
data.to_csv('out.csv')

In [94]:
!cat out.csv

,something,a,b,c,d,message
0,one,1,2,3.0,4,
1,two,5,6,,8,world
2,three,9,10,11.0,12,foo

In [95]:
import sys

In [96]:
data.to_csv(sys.stdout, sep='|')

|something|a|b|c|d|message
0|one|1|2|3.0|4|
1|two|5|6||8|world
2|three|9|10|11.0|12|foo

In [97]:
data.to_csv(sys.stdout, na_rep='NULL')

,something,a,b,c,d,message
0,one,1,2,3.0,4,NULL
1,two,5,6,NULL,8,world
2,three,9,10,11.0,12,foo

In [98]:
data.to_csv(sys.stdout, index=False, header=False)

one,1,2,3.0,4,
two,5,6,,8,world
three,9,10,11.0,12,foo

In [99]:
data.to_csv(sys.stdout, index=False, columns=['a', 'b', 'c'])

a,b,c
1,2,3.0
5,6,
9,10,11.0

In [100]:
import numpy as np
dates = pd.date_range('1/1/2000', periods = 7)
ts = pd.Series(np.arange(7), index = dates)
ts.to_csv('tseries.csv')
!cat tseries.csv

,0
2000-01-01,0
2000-01-02,1
2000-01-03,2
2000-01-04,3
2000-01-05,4
2000-01-06,5
2000-01-07,6

In [101]:
obj = """ {"name": "Wes",
"places_lived": ["United States", "Spain", "Germany"], "pet": null,
"siblings": [{"name": "Scott", "age": 30, "pets": ["Zeus", "Zuko"]}, {"name": "Katie", "age": 38, "pets": ["Sixes", "Stache", "Cisco"]}]
} """

In [102]:
import json

In [103]:
result = json.loads(obj)

result

{'name': 'Wes',
 'pet': None,
 'places_lived': ['United States', 'Spain', 'Germany'],
 'siblings': [{'age': 30, 'name': 'Scott', 'pets': ['Zeus', 'Zuko']},
  {'age': 38, 'name': 'Katie', 'pets': ['Sixes', 'Stache', 'Cisco']}]}

In [104]:
pip install beautifulsoup4 html5lib

Requirement already satisfied: beautifulsoup4 in /usr/local/lib/python3.6/dist-packages (4.6.3)
Requirement already satisfied: html5lib in /usr/local/lib/python3.6/dist-packages (1.0.1)
Requirement already satisfied: six>=1.9 in /usr/local/lib/python3.6/dist-packages (from html5lib) (1.15.0)
Requirement already satisfied: webencodings in /usr/local/lib/python3.6/dist-packages (from html5lib) (0.5.1)

In [105]:
tables = pd.read_html('fdic_failed_bank_list.html')
len(tables)

1

In [106]:
failures = tables[0]

In [107]:
failures.head()

                      Bank Name  ...       Updated Date
0                   Allied Bank  ...  November 17, 2016
1  The Woodbury Banking Company  ...  November 17, 2016
2        First CornerStone Bank  ...  September 6, 2016
3            Trust Company Bank  ...  September 6, 2016
4    North Milwaukee State Bank  ...      June 16, 2016

[5 rows x 7 columns]

In [108]:
pip install beautifulsoup4 html5lib

Requirement already satisfied: beautifulsoup4 in /usr/local/lib/python3.6/dist-packages (4.6.3)
Requirement already satisfied: html5lib in /usr/local/lib/python3.6/dist-packages (1.0.1)
Requirement already satisfied: six>=1.9 in /usr/local/lib/python3.6/dist-packages (from html5lib) (1.15.0)
Requirement already satisfied: webencodings in /usr/local/lib/python3.6/dist-packages (from html5lib) (0.5.1)

In [109]:
tables = pd.read_html('naver.html')

In [110]:
tables

[          업종명    전일대비 등락그래프
 0         NaN     NaN   NaN
 1      가스유틸리티  +5.21%  100%
 2   항공화물운송과물류  +3.83%   73%
 3          철강  +2.46%   47%
 4         NaN     NaN   NaN
 ..        ...     ...   ...
 7        판매업체  +1.38%   26%
 8         문구류  +1.35%   25%
 9     무선통신서비스  +1.26%   24%
 10        NaN     NaN   NaN
 11        NaN     NaN   NaN

 [12 rows x 3 columns],                  테마명     전일대비         주도주
 0                NaN      NaN         NaN
 1            일자리(취업)  +10.46%    상한  에스코넥
 2             골판지 제조   +2.48%    상승  태림포장
 3   셰일가스(Shale Ga...   +2.29%    상승  우림기계
 4                NaN      NaN         NaN
 ..               ...      ...         ...
 7               도시가스   +1.79%  상승  한국가스공사
 8        LPG(액화석유가스)   +1.47%    상승  SK가스
 9       코로나19(렘데시비르)   +1.44%    상승  맥스로텍
 10               NaN      NaN         NaN
 11               NaN      NaN         NaN

 [12 rows x 3 columns],      0                 1         2          3
 0  NaN               NaN       NaN        NaN
 1  NaN              삼성전자   60000.0    하락  900
 2  NaN             NAVER  292500.0  하락  6,000
 3  NaN                씨젠  287400.0  하락  1,100
 4  NaN               NaN       NaN        NaN
 ..  ..               ...       ...        ...
 7  NaN             삼성전자우   53200.0    하락  400
 8  NaN  KODEX 200선물인버스2X    4095.0     상승  65
 9  NaN            CJ대한통운  181500.0  상승  1,000
 10 NaN               NaN       NaN        NaN
 11 NaN               NaN       NaN        NaN

 [12 rows x 4 columns],      0                 1         2          3
 0  NaN               NaN       NaN        NaN
 1  NaN  KODEX 200선물인버스2X    4095.0     상승  65
 2  NaN             SK텔레콤  234500.0  상승  4,000
 3  NaN              한국전력   21300.0    상승  150
 4  NaN               NaN       NaN        NaN
 ..  ..               ...       ...        ...
 7  NaN               이마트  157000.0  상승  2,000
 8  NaN              썸에이지    1460.0    하락  120
 9  NaN             두산중공업   11800.0     하락  50
 10 NaN               NaN       NaN        NaN
 11 NaN               NaN       NaN        NaN

 [12 rows x 4 columns],          0      1   2
 0  유유제약2우B  45500 NaN
 1    쌍용양회우  66300 NaN
 2      모아텍  18200 NaN
 3    남선알미우  69500 NaN
 4   진흥기업우B  14000 NaN
 5    압타바이오  36000 NaN
 6      동양우   8320 NaN
 7     태림포장   4915 NaN
 8    아세아제지  30550 NaN
 9  진흥기업2우B  15600 NaN,     순위   연속   누적       종목명  ...         거래량       시가       고가       저가
 0  NaN  NaN  NaN       NaN  ...         NaN      NaN      NaN      NaN
 1  NaN  1.0  7.0     흥국화재우  ...    738312.0  13300.0  16400.0  12950.0
 2  NaN  1.0  2.0    진흥기업우B  ...    859938.0  11500.0  14000.0  11400.0
 3  NaN  5.0  9.0     쌍용양회우  ...    188017.0  59500.0  66300.0  57600.0
 4  NaN  1.0  4.0     남선알미우  ...     25981.0  53800.0  69500.0  53800.0
 ..  ..  ...  ...       ...  ...         ...      ...      ...      ...
 11 NaN  1.0  2.0        씨앗  ...      5407.0   2000.0   2040.0   2000.0
 12 NaN  1.0  1.0  TS인베스트먼트  ...  34847019.0   2735.0   3545.0   2735.0
 13 NaN  1.0  8.0     테크트랜스  ...      1778.0   1790.0   1790.0   1500.0
 14 NaN  NaN  NaN       NaN  ...         NaN      NaN      NaN      NaN
 15 NaN  NaN  NaN       NaN  ...         NaN      NaN      NaN      NaN

 [16 rows x 11 columns]]

In [111]:
failures = tables[5]

In [112]:
failures.head()

   순위   연속   누적     종목명      현재가  ...      등락률       거래량       시가       고가       저가
0 NaN  NaN  NaN     NaN      NaN  ...      NaN       NaN      NaN      NaN      NaN
1 NaN  1.0  7.0   흥국화재우  16400.0  ...  +29.64%  738312.0  13300.0  16400.0  12950.0
2 NaN  1.0  2.0  진흥기업우B  14000.0  ...  +29.63%  859938.0  11500.0  14000.0  11400.0
3 NaN  5.0  9.0   쌍용양회우  66300.0  ...  +30.00%  188017.0  59500.0  66300.0  57600.0
4 NaN  1.0  4.0   남선알미우  69500.0  ...  +29.91%   25981.0  53800.0  69500.0  53800.0

[5 rows x 11 columns]

In [113]:
tables = pd.read_html('naver_movie_rank.html')

In [114]:
tables

[    순위      영화명  변동폭  변동폭.1  Unnamed: 4  Unnamed: 5  Unnamed: 6  Unnamed: 7
 0  NaN      NaN  NaN    NaN         NaN         NaN         NaN         NaN
 1  NaN       담보  NaN    0.0         NaN         NaN         NaN         NaN
 2  NaN     언힌지드  NaN    0.0         NaN         NaN         NaN         NaN
 3  NaN     국제수사  NaN    0.0         NaN         NaN         NaN         NaN
 4  NaN     그린랜드  NaN    0.0         NaN         NaN         NaN         NaN
 ..  ..      ...  ...    ...         ...         ...         ...         ...
 51 NaN  먼 훗날 우리  NaN    1.0         NaN         NaN         NaN         NaN
 52 NaN    마르지엘라  NaN    7.0         NaN         NaN         NaN         NaN
 53 NaN      그리드  NaN   11.0         NaN         NaN         NaN         NaN
 54 NaN      게이트  NaN    2.0         NaN         NaN         NaN         NaN
 55 NaN      NaN  NaN    NaN         NaN         NaN         NaN         NaN

 [56 rows x 8 columns]]

In [115]:
failures = tables[0]

In [116]:
failures

    순위      영화명  변동폭  변동폭.1  Unnamed: 4  Unnamed: 5  Unnamed: 6  Unnamed: 7
0  NaN      NaN  NaN    NaN         NaN         NaN         NaN         NaN
1  NaN       담보  NaN    0.0         NaN         NaN         NaN         NaN
2  NaN     언힌지드  NaN    0.0         NaN         NaN         NaN         NaN
3  NaN     국제수사  NaN    0.0         NaN         NaN         NaN         NaN
4  NaN     그린랜드  NaN    0.0         NaN         NaN         NaN         NaN
..  ..      ...  ...    ...         ...         ...         ...         ...
51 NaN  먼 훗날 우리  NaN    1.0         NaN         NaN         NaN         NaN
52 NaN    마르지엘라  NaN    7.0         NaN         NaN         NaN         NaN
53 NaN      그리드  NaN   11.0         NaN         NaN         NaN         NaN
54 NaN      게이트  NaN    2.0         NaN         NaN         NaN         NaN
55 NaN      NaN  NaN    NaN         NaN         NaN         NaN         NaN

[56 rows x 8 columns]

In [117]:
from lxml import objectify

In [118]:
path = 'Performance_MNR.xml'
parsed = objectify.parse(open(path))
root = parsed.getroot()

In [119]:
data = []

In [120]:
skip_fields = ['PARENT_SEQ', 'INDICATOR_SEQ',
               'DESIRED_CHANGE', 'DECIMAL_PLACES']

for elt in root.INDICATOR:
  el_data = {}
  for child in elt.getchildren():
    if child.tag in skip_fields:
      continue
    el_data[child.tag] = child.pyval
  data.append(el_data)

In [121]:
perf = pd.DataFrame(data)

In [122]:
perf,head()

NameError: ignored